           TESTSUITE 'GREETING AND FAREWELL'

           TESTCASE 'IT RETURNS HELLO, WORLD! AS GREETING' 
           MOVE 'GREETING' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE TO BE 'HELLO, WORLD!'

           TESTCASE 'IT RETURNS GOODBYE, WORLD! AS FAREWELL' 
           MOVE 'FAREWELL' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE TO BE 'GOODBYE, WORLD!'
