       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HELLO.     
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

       2000-SPEAK.
           DISPLAY "HELLO WORLD!"   
           .    

       9999-END.
           .
